{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Shahid Moosa - Distributed Systems Engineering",
  "home_page_url": "https://shahidster.tech",
  "feed_url": "https://shahidster.tech/feed.json",
  "description": "Deep dives into distributed databases, data infrastructure, and production systems. Written by a senior distributed-systems engineer.",
  "language": "en-US",
  "items": [
    {
      "id": "https://shahidster.tech/blog/cap-theorem-production",
      "url": "https://shahidster.tech/blog/cap-theorem-production",
      "title": "Understanding CAP Theorem in Production",
      "summary": "A practical guide to navigating consistency, availability, and partition tolerance trade-offs when architecting distributed databases.",
      "content_text": "Beyond the Textbook The CAP theorem states that a distributed system can provide only two of three guarantees: Consistency, Availability, and Partition Tolerance. Most engineers learn this in school and move on. But applying it in production requires deeper understanding. This post is the foundation for everything that follows in this series. The tradeoffs we explore here—consistency vs. availability, strong vs. eventual—will resurface in every architectural decision we make. The Practical Reali...",
      "date_published": "2025-11-01T00:00:00.000Z",
      "tags": [
        "Fundamentals",
        "CAP theorem",
        "distributed systems",
        "consistency vs availability",
        "partition tolerance"
      ]
    },
    {
      "id": "https://shahidster.tech/blog/pragmatic-consistency",
      "url": "https://shahidster.tech/blog/pragmatic-consistency",
      "title": "Pragmatic Consistency: When Stronger Isn't Better",
      "summary": "The case against defaulting to strict serializability. Mapping business requirements to the lowest viable consistency level for maximum scalability.",
      "content_text": "The Consistency Trap When architects design distributed systems, they often default to the strongest consistency model available. \"Better safe than sorry,\" they say. But this safety has a cost—often a severe one. In Part 1, we established the fundamental CAP tradeoffs. Now we go deeper: even within a consistency-prioritizing (CP) system, there's a spectrum of isolation levels. Choosing wisely is the difference between a system that scales and one that crawls. Strict serializability requires coor...",
      "date_published": "2025-12-01T00:00:00.000Z",
      "tags": [
        "Architecture",
        "consistency levels",
        "serializability",
        "isolation levels",
        "database scalability"
      ]
    },
    {
      "id": "https://shahidster.tech/blog/latency-tax-separated-compute-storage",
      "url": "https://shahidster.tech/blog/latency-tax-separated-compute-storage",
      "title": "The Latency Tax of Separated Compute and Storage",
      "summary": "A critical analysis of disaggregated storage architectures vs shared-nothing systems. Examining network I/O penalties and why caching layers fail for high-concurrency point lookups.",
      "content_text": "The Promise and Reality of Disaggregation The cloud-native database movement has championed separated compute and storage as the path to infinite scalability. Services like Snowflake, BigQuery, and Aurora have proven this architecture can work brilliantly—for certain workloads. But there's a cost that often goes unmentioned in the marketing materials: the latency tax. In Part 2, we explored how different consistency levels trade latency for correctness. Disaggregated storage adds another dimensi...",
      "date_published": "2026-01-01T00:00:00.000Z",
      "tags": [
        "Architecture",
        "disaggregated storage",
        "compute storage separation",
        "NVMe latency",
        "cache coherency",
        "HTAP architecture"
      ]
    },
    {
      "id": "https://shahidster.tech/blog/data-skew-distributed-joins",
      "url": "https://shahidster.tech/blog/data-skew-distributed-joins",
      "title": "Surviving Data Skew in Distributed Joins",
      "summary": "How uneven data distribution destroys shuffle join performance. Contrasting broadcast joins vs repartitioning and why query optimizers often miss skew.",
      "content_text": "The Silent Performance Killer You've built a distributed query engine. The benchmarks look great. Then you deploy to production, and some queries take 100x longer than expected. The culprit? Data skew. We've established that consistency comes at a cost and storage architecture impacts latency. But even with optimal consistency and storage choices, skew can obliterate performance. Skew occurs when data isn't evenly distributed across partitions. In a shuffle join, one node might process 90% of th...",
      "date_published": "2025-12-01T00:00:00.000Z",
      "tags": [
        "Performance",
        "data skew",
        "distributed joins",
        "shuffle join",
        "broadcast join",
        "Spark AQE"
      ]
    },
    {
      "id": "https://shahidster.tech/blog/non-blocking-ddl-myth",
      "url": "https://shahidster.tech/blog/non-blocking-ddl-myth",
      "title": "Non-Blocking DDL is a Myth: Schema Evolution at Scale",
      "summary": "How lock propagation and metadata sync cause latency spikes even in 'online' DDL. Defensive patterns for schema migration using expansion/contraction strategies.",
      "content_text": "The Marketing vs. Reality Every major database now claims to support \"online\" or \"non-blocking\" DDL operations. ALTER TABLE without downtime! Add columns without locking! It sounds perfect—until you try it at scale. The truth is more nuanced. While these operations don't hold exclusive locks for the entire duration, they still cause measurable performance degradation. Understanding *why* is crucial for planning schema migrations. This builds on our exploration of data skew in distributed joins. ...",
      "date_published": "2026-01-01T00:00:00.000Z",
      "tags": [
        "Deep Dive",
        "online DDL",
        "schema migration",
        "metadata locks",
        "database migration patterns",
        "expansion contraction"
      ]
    },
    {
      "id": "https://shahidster.tech/blog/defensive-ingestion-backpressure-htap",
      "url": "https://shahidster.tech/blog/defensive-ingestion-backpressure-htap",
      "title": "Defensive Ingestion: Managing Backpressure in HTAP Systems",
      "summary": "Protecting HTAP systems from ingestion floods. Why Kafka alone isn't enough and how to implement database-aware flow control.",
      "content_text": "The HTAP Promise and Peril Hybrid Transactional/Analytical Processing (HTAP) systems promise the best of both worlds: real-time analytics on live operational data. No ETL pipelines, no stale data, no separate systems to maintain. But this power comes with a dangerous coupling: when ingestion spikes, analytical queries suffer. When complex analytics run, transactions slow down. Without careful flow control, one workload can starve the other. This is where CAP theorem realities meet operational pr...",
      "date_published": "2025-11-01T00:00:00.000Z",
      "tags": [
        "Operations",
        "HTAP systems",
        "backpressure",
        "Kafka ingestion",
        "flow control",
        "resource isolation"
      ]
    },
    {
      "id": "https://shahidster.tech/blog/query-optimization-petabyte-scale",
      "url": "https://shahidster.tech/blog/query-optimization-petabyte-scale",
      "title": "Query Optimization at Petabyte Scale",
      "summary": "Lessons learned from debugging slow queries across distributed nodes. Execution plans, index strategies, and memory management.",
      "content_text": "When Queries Go Wrong at Scale A query that runs in 100ms on a gigabyte runs in 10 minutes on a petabyte—if you're lucky. At scale, every inefficiency is amplified. A bad join strategy doesn't just slow things down; it can crash your cluster. This is where data skew detection becomes critical. Skew turns a linear scaling problem into an exponential one. Reading Execution Plans The execution plan is your map. Learn to read it fluently. Key things to spot: Sequential Scans on Large Tables This is ...",
      "date_published": "2025-10-01T00:00:00.000Z",
      "tags": [
        "Deep Dive",
        "query optimization",
        "execution plans",
        "covering indexes",
        "partition pruning",
        "petabyte scale"
      ]
    },
    {
      "id": "https://shahidster.tech/blog/incident-response-database-engineers",
      "url": "https://shahidster.tech/blog/incident-response-database-engineers",
      "title": "Incident Response for Database Engineers",
      "summary": "A battle-tested playbook for handling production database incidents. From detection to resolution to post-mortem.",
      "content_text": "When the Pager Goes Off It's 3 AM. Your phone buzzes. \"Database latency critical.\" Your heart rate spikes. What do you do? This playbook has been refined over dozens of incidents. It won't make incidents pleasant, but it will make them manageable. Every concept we've covered in this series—from CAP tradeoffs to query optimization—converges in incident response. You need all of it, quickly. Phase 1: Assess (First 5 Minutes) Don't touch anything yet. Gather information. Immediate Questions 1. What...",
      "date_published": "2025-10-01T00:00:00.000Z",
      "tags": [
        "Operations",
        "incident response",
        "database postmortem",
        "production debugging",
        "runbooks",
        "on-call"
      ]
    },
    {
      "id": "https://shahidster.tech/blog/sharding-strategies-that-work",
      "url": "https://shahidster.tech/blog/sharding-strategies-that-work",
      "title": "Sharding Strategies That Actually Work",
      "summary": "Comparing hash, range, and geo-based sharding with real performance benchmarks and migration patterns.",
      "content_text": "Why Shard? When your database hits the limits of a single machine—CPU, memory, storage, or IOPS—you have two choices: scale up (bigger machine) or scale out (more machines). Sharding is how you scale out. But sharding isn't free. It adds complexity, complicates joins, and can create hotspots. Choose your strategy carefully. This is the capstone of our series. Sharding decisions draw on everything we've covered: CAP tradeoffs determine your consistency across shards, data skew patterns inform key...",
      "date_published": "2025-09-01T00:00:00.000Z",
      "tags": [
        "Architecture",
        "database sharding",
        "hash sharding",
        "range sharding",
        "geo sharding",
        "resharding migration"
      ]
    }
  ]
}